mmsafe/config/defaults/full_eval.yaml
name: "full-multimodal-safety-evaluation"
version: "1.0"

models:
  # Text
  - provider: openai
    model: gpt-4o
    modalities: [text]
  - provider: anthropic
    model: claude-sonnet-4-20250514
    modalities: [text]
  - provider: replicate
    model: meta/meta-llama-3.1-405b-instruct
    modalities: [text]
  # Image
  - provider: replicate
    model: black-forest-labs/flux-1.1-pro
    modalities: [image]
  - provider: openai
    model: dall-e-3
    modalities: [image]
  # Video
  - provider: google
    model: veo-3.1
    modalities: [video]
  - provider: replicate
    model: kwaivgi/kling-v2.6
    modalities: [video]
  # Audio
  - provider: replicate
    model: resemble-ai/chatterbox
    modalities: [audio]
  - provider: elevenlabs
    model: eleven_multilingual_v2
    modalities: [audio]

datasets:
  # Text
  - path: datasets/text/mlcommons_hazards.jsonl
    modality: text
  - path: datasets/text/benign_prompts.jsonl
    modality: text
    is_benign: true
  # Image
  - path: datasets/image/unsafe_generation.jsonl
    modality: image
  - path: datasets/image/benign_generation.jsonl
    modality: image
    is_benign: true
  # Video
  - path: datasets/video/unsafe_generation.jsonl
    modality: video
  - path: datasets/video/benign_generation.jsonl
    modality: video
    is_benign: true
  # Audio
  - path: datasets/audio/harmful_speech.jsonl
    modality: audio
  - path: datasets/audio/voice_cloning.jsonl
    modality: audio
  - path: datasets/audio/benign_speech.jsonl
    modality: audio
    is_benign: true
  # Cross-modal
  - path: datasets/cross_modal/text_to_image_injection.jsonl
    modality: image

attacks:
  - name: passthrough
  - name: jailbreak
    variants: [dan, aim, developer_mode]
  - name: encoding
    variants: [base64, rot13, unicode_substitution]
  - name: role_play
    variants: [fictional_character, expert_persona]
  - name: multi_turn
    max_turns: 5
    escalation: gradual
  - name: cross_modal
    applicable_modalities: [image, video]
  - name: adversarial_suffix
  - name: translation
    parameters:
      target_languages: [zu, sw, ht]

judges:
  - name: llm_judge
    model: gpt-4o
    provider: openai
    weight: 0.5
  - name: keyword_judge
    weight: 0.15
  - name: toxicity_judge
    weight: 0.15
  - name: nsfw_classifier
    weight: 0.2

execution:
  concurrency: 5
  timeout_seconds: 180
  retry_attempts: 3
  checkpoint_interval: 50
  profile: auto
  auto_tune: true
  strict_provider_init: false

edge:
  enabled: false

metrics:
  confidence_interval: 0.95
  bootstrap_samples: 1000

output:
  directory: artifacts
  formats: [json, html, markdown]
  leaderboard: true
  include_raw_samples: false